---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.IsStringValue
source: html/6f4ef6ca-b44c-dd64-32e1-dd1bc236f89a.htm
---
# Autodesk.Revit.DB.ScheduleFilter.IsStringValue Property

Indicates if the filter has a string value.

## Syntax (C#)
```csharp
public bool IsStringValue { get; }
```